## Project: Auth

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:483163207623:certificate/e9dff11a-7f23-4694-b8b8-a023ae62000e]
aws_cognito_user_pool.pool: Refreshing state... [id=eu-west-1_KJTAS2MpX]
aws_route53_record.record["auth.aws.eliasbrange.dev"]: Refreshing state... [id=Z08509072ZDU78NDNFK37__92e08e56abd0703a44e126d5dd2c443d.auth.aws.eliasbrange.dev._CNAME]
aws_ssm_parameter.test_ssm: Refreshing state... [id=/eliasb/auth_test_ssm]
aws_ssm_parameter.pool_ssm: Refreshing state... [id=/eliasb/cognito_user_pool]
aws_cognito_user_pool_domain.pool_domain: Refreshing state... [id=auth.aws.eliasbrange.dev]
aws_route53_record.cognito_record: Refreshing state... [id=Z08509072ZDU78NDNFK37_auth.aws.eliasbrange.dev_A]
aws_acm_certificate_validation.validation: Refreshing state... [id=2022-03-08 16:48:29.476 +0000 UTC]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_ssm_parameter.test_ssm has changed
!   resource "aws_ssm_parameter" "test_ssm" {
        id        = "/eliasb/auth_test_ssm"
        name      = "/eliasb/auth_test_ssm"
+       tags      = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_ssm_parameter.pool_ssm2 will be created
+   resource "aws_ssm_parameter" "pool_ssm2" {
+       arn       = (known after apply)
+       data_type = (known after apply)
+       id        = (known after apply)
+       key_id    = (known after apply)
+       name      = "/eliasb/cognito_user_pool2"
+       tags_all  = (known after apply)
+       tier      = "Standard"
+       type      = "String"
+       value     = (sensitive value)
+       version   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @eliasbrange, Action: `pull_request`, Working Directory: `auth`, Workflow: `AUTH - Pull request`*
<!-- Sticky Pull Request CommentAuth -->